---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SingleServerService Properties
SingleServerService Class See Also Send Feedback
---

The SingleServerService type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Description | The description for the service  (Inherited from ExternalService.) |
|  | IsSerializable | Indicates whether executions of the service requires serialization in documents or not.  (Inherited from ExternalService.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ExternalService.) |
|  | Name | The name of the service  (Inherited from ExternalService.) |
|  | NumberOfServers | Indicates the number of servers currently registered with the service.  (Inherited from ExternalService.) |
|  | ServiceId | The Id of the service  (Inherited from ExternalService.) |
|  | SupportActivation | Indicates if the service supports activation/deactivation of the servers.  (Inherited from ExternalService.) |
|  | VendorId | The vendor who provided the service  (Inherited from ExternalService.) |

# See Also

SingleServerService Class

Autodesk.Revit.DB.ExternalService Namespace